benchmarks/2026-05-26_00-30-39_pgbench_scx_adapt/pgbench_out.log
pgbench (18.3)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 100
query mode: simple
number of clients: 15
number of threads: 8
maximum number of tries: 1
number of transactions per client: 3000
number of transactions actually processed: 45000/45000
number of failed transactions: 0 (0.000%)
latency average = 4.997 ms
initial connection time = 13.121 ms
tps = 3001.755827 (without initial connection time)